FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_I2C.c
        // Enable ACKBT
        p_regs->ICMR3.BIT.ACKWP = 1;

        // Don't worry about timeout
        p_regs->ICFER.BIT.TMOE = 0;
        // No, enable timeout
        //p_regs->ICFER.BIT.TMOE = 1;

        // Enable master arbitration lost detection
        p_regs->ICFER.BIT.MALE = 1;
        ///	    p_regs->ICFER.BIT.MALE = 0;

        // Done with configuration, turn on I2C
        p_regs->ICCR1.BIT.ICE = 1;

        // Initialized/Reset
        p->iFirstInit = ETrue;
    } else {
        // Configure the speed
        IRX63N_I2CSetSpeed(p->iRegs, p->iRequest->iSpeed);

        // Done with configuration, turn on I2C
        //	    p_regs->ICCR1.BIT.ICE = 1;
    }
}

static T_uezError IRX63N_I2C_ForceBusReset(void *aWorkspace)
{
    T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;
    T_RX63N_i2cRegs *p_regs = p->iRegs;
    TUInt32 i;
    TUInt8 numTries;
    TUInt16 timeout;

    // Determine if the SDA line is low
//    if (p_regs->ICCR1.BIT.SDAI == 1) {
        // If SDA is high, I don't know what the problem is
//        return UEZ_ERROR_COULD_NOT_RESET;
//    }

    // Let's force a reset of the I2C bus.
    // But, first, reset the RIIC itself. This requires several steps.
    p_regs->ICCR1.BIT.ICE = 0;
    p_regs->ICCR1.BIT.IICRST = 1;
    // wait a bit here
    for (i = 0; i < 10000; i++)
        ;
    p_regs->ICCR1.BIT.IICRST = 0;
    // wait a bit here
    for (i = 0; i < 10000; i++)
        ;
    // Turn back on the lines
    p_regs->ICCR1.BIT.ICE = 1;

    // Initialize the I2C fully again
    p->iFirstInit = EFalse;
    IRX63N_I2CInit(p);

    // If after reset the clock is stuck low, we cannot fix it this way
    if (p_regs->ICCR1.BIT.SCLI == 0) {
        return UEZ_ERROR_COULD_NOT_RESET;
    }

    // Alright, now we are ready to do the bus reset
    // What has to happen is we need to output extra clocks
    // on SCLO.  The slave device that is holding the device
    // just needs to be released.  We'll know when the slave released
    // by the SDA rising again.
    // Do this a limited number of times.
    for (numTries = 0; numTries < 16; numTries++) {
        // Force out a clock cycle (CLO will go zero automatically)
        p_regs->ICCR1.BIT.CLO = 1;
        // See if the SDA drops
        timeout = 10000;
        while (timeout--) {
            // Did the SDA line rise?
            if (p_regs->ICCR1.BIT.SDAI == 1)
                break;
        }
        // If we didn't timeout, then it worked
        if (timeout)
            break;
    }

    // If we got here and SDA is low, then we failed
    if (p_regs->ICCR1.BIT.SDAI == 0)
        return UEZ_ERROR_COULD_NOT_RESET;

    // Otherwise, we have success
    return UEZ_ERROR_NONE;
}

static void IRX63N_I2C_StartWriteInterrupts(
        void *aWorkspace,
        I2C_Request *iRequest,
        void *aCallbackWorkspace,
        I2CRequestCompleteCallback aCallbackFunc)
{
    T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;
    T_RX63N_i2cRegs *p_regs = p->iRegs;
    TUInt32 timeout;

    // Use an address (and make sure the lowest bit is zero)
    p->iRequest = iRequest;
    p->iCompleteFunc = aCallbackFunc;
    p->iCompleteWorkspace = aCallbackWorkspace;
    p->iAddress = (p->iRequest->iAddr << 1) | I2C_MODE_WRITE;
    p->iData = (TUInt8 *)p->iRequest->iWriteData;
    p->iDataLen = p->iRequest->iWriteLength;
    p->iIndex = 0;
    p->iDoneFlag = EFalse;
    p->iRequest->iStatus = I2C_BUSY;

    // Initialize the I2C
    IRX63N_I2CInit(p);
    track_start();

    // Wait a bit of time to if busy or low sda line
    timeout = 10000;
    while (((p_regs->ICCR2.BIT.BBSY) || (p_regs->ICCR1.BIT.SDAI == 0)) && (timeout)) {
        timeout--;
    }
    
    // Don't process if the bus is busy!
    if ((p_regs->ICCR2.BIT.BBSY) || (p_regs->ICCR1.BIT.SDAI == 0)) {
        // Assume we are locked up (we should never overlap actions!)
        // Try to reset the bus
        if (IRX63N_I2C_ForceBusReset(aWorkspace) != UEZ_ERROR_NONE) {
            // Reset of the bus failed
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            p->iRequest->iStatus = I2C_NOT_READY;
            return;
        }
    }

    // Issue a start condition and let the interrupts do the rest
    p_regs->ICSR2.BIT.STOP = 0;
    p->iState = I2C_STATE_START;

    p_regs->ICCR2.BIT.ST = 1;
	
//	for (timeout=0; timeout<5; timeout++)
//	  	nop()  ;
			
    // Start receiving interrupts
    // I2C Bus Interrupt Enable Register (ICIER)
    // 1--- ----   TIE = Transmit data empty interrupt request (ICTXI) is enabled
    // -1-- ----   TEIE = Transmit end interrupt request (ICTEI) is enabled
    // --1- ----   RIE = Receive data full interrupt request (ICRXI) is enabled
    // ---1 ----   NAKIE = NACK reception interrupt request (NAKI) is enabled
    // ---- 1---   SPIE = Stop condition detection interrupt request (SPI) is enabled
    // ---- -1--   STIE = Start condition detection interrupt request (STI) is enabled
    // ---- --1-   ALIE = Arbitration lost interrupt request (ALI) is enabled
    // ---- ---1   TMOIE = Timeout interrupt request (TMOI) is enabled
    p_regs->ICIER.BYTE = 0xFF; // 0xFB;
}

static void IRX63N_I2C_StartReadInterrupts(
        void *aWorkspace,
        I2C_Request *iRequest,
        void *aCallbackWorkspace,
        I2CRequestCompleteCallback aCallbackFunc)
{
    T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;
    T_RX63N_i2cRegs *p_regs = p->iRegs;
    TUInt32 timeout;

    // Use an address (and make sure the lowest bit is zero)
    p->iRequest = iRequest;
    p->iCompleteFunc = aCallbackFunc;
    p->iCompleteWorkspace = aCallbackWorkspace;
    p->iAddress = (p->iRequest->iAddr << 1) | I2C_MODE_READ;
    p->iData = p->iRequest->iReadData;
    p->iDataLen = p->iRequest->iReadLength;
    p->iIndex = 0;
    p->iDoneFlag = EFalse;
    p->iRequest->iStatus = I2C_BUSY;

    // Initialize the I2C
    IRX63N_I2CInit(p);
    track_start();
    track('|');

    // Wait a bit of time to if busy or low sda line
    timeout = 10000;
    while (((p_regs->ICCR2.BIT.BBSY) || (p_regs->ICCR1.BIT.SDAI == 0)) && (timeout)) {
        timeout--;
    }
    
