FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_I2C.c
    // Don't process if the bus is busy!
    if ((p_regs->ICCR2.BIT.BBSY) || (p_regs->ICCR1.BIT.SDAI == 0)) {
        // Assume we are locked up (we should never overlap actions!)
        // Try to reset the bus
        if (IRX63N_I2C_ForceBusReset(aWorkspace) != UEZ_ERROR_NONE) {
            // Reset of the bus failed
            p->iDoneFlag = ETrue;
            p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
            p->iRequest->iStatus = I2C_NOT_READY;
            return;
        }
    }

    // Issue a start condition
    p_regs->ICSR2.BIT.STOP = 0;
    p->iState = I2C_STATE_START;
    p_regs->ICCR2.BIT.ST = 1;

    // Start receiving interrupts
    // I2C Bus Interrupt Enable Register (ICIER)
    // 1--- ----   TIE = Transmit data empty interrupt request (ICTXI) is enabled
    // -1-- ----   TEIE = Transmit end interrupt request (ICTEI) is enabled
    // --1- ----   RIE = Receive data full interrupt request (ICRXI) is enabled
    // ---1 ----   NAKIE = NACK reception interrupt request (NAKI) is enabled
    // ---- 1---   SPIE = Stop condition detection interrupt request (SPI) is enabled
    // ---- -1--   STIE = Start condition detection interrupt request (STI) is enabled
    // ---- --1-   ALIE = Arbitration lost interrupt request (ALI) is enabled
    // ---- ---1   TMOIE = Timeout interrupt request (TMOI) is enabled
    p_regs->ICIER.BYTE = 0xFF; // 0xFB;
}

/*-------------------------------------------------------------------------*
 * Routine:  IRX63N_ProcessState
 *-------------------------------------------------------------------------*
 * Description:
 *      Core I2C processing (typically done in interrupt routine)
 *-------------------------------------------------------------------------*/
static void IRX63N_ProcessStateWrite(
        T_RX63N_I2C_Workspace *p,
        T_i2cInterrupt aInterrupt)
{
    T_RX63N_i2cRegs *p_regs = p->iRegs;
    TBool doEnd = EFalse;
    TBool doState = ETrue;
    TBool doStop = EFalse;
    TUInt8 status = p_regs->ICSR2.BYTE;
    TUInt8 status2;
    TUInt8 dummy;

    dummy = dummy;
    track('-');
    track('0' + aInterrupt);
    if (status & BIT_TMOF) {
        track('/');
        track('T');
        p_regs->ICCR2.BIT.ST = 0;
        p_regs->ICCR2.BIT.RS = 0;
        p_regs->ICCR2.BIT.SP = 0;
        p_regs->ICSR2.BIT.TMOF = 0;
        p->iRequest->iStatus = I2C_ERROR;
        doState = EFalse;
        doEnd = ETrue;
    }
    if (status & BIT_AL) {
        track('/');
        track('L');
        p_regs->ICCR2.BIT.ST = 0;
        p_regs->ICCR2.BIT.RS = 0;
        p_regs->ICCR2.BIT.SP = 0;
        p_regs->ICSR2.BIT.TMOF = 0;
        p->iRequest->iStatus = I2C_ERROR;
        doState = EFalse;
        doEnd = ETrue;
    }
    if (doState) {
        switch (p->iState) {
            case I2C_STATE_START:
                track('S');
                if (status & BIT_STOP) {
                    // We got a stop just as we are starting!
                    // Don't try to continue, but try to abort
                    doStop = ETrue;
                    track('?');
                } else if (status & BIT_TDRE) { // (aInterrupt == I2C_INTERRUPT_ICTXI) {
                    // We just sent the start bit, now send the address
                    p->iState = I2C_STATE_ADDR;
                    p_regs->ICDRT = p->iAddress;
                    track('a');
                } else {
                    track('e');
                    // Got some type of error
                    p->iRequest->iStatus = I2C_ERROR;
                    doStop = ETrue;
                }
                if (status & BIT_START)
                    p_regs->ICSR2.BIT.START = 0;
                break;
            case I2C_STATE_ADDR:
                p_regs->ICSR2.BIT.START = 0;
                track('A');
				status2 = p_regs->ICSR2.BYTE;
                if ((aInterrupt == I2C_INTERRUPT_ICTXI)
                        && (/*p_regs->ICSR2.BIT.TDRE*/status2 & BIT_TDRE)) {
                    // Finished sending slave address, and got ack
                    // Now send the first byte of the transfer (if any data, else abort)
                    p->iState = I2C_STATE_DATA;
                    if (p->iDataLen) {
                        // Got data, send the first byte and a new interrupt will occur
                        p->iIndex = 0;
                        p_regs->ICDRT = p->iData[p->iIndex++];
                        track('d');
                    } else {
                        // No data payload, just stop here
                        p->iRequest->iStatus = I2C_OK;
                        doStop = ETrue;
                        track('e');
                    }
                } else /* if (aInterrupt == I2C_INTERRUPT_ICEEI) */{
                    // NAK or some type of error
                    p->iRequest->iStatus = I2C_ERROR;
                    doStop = ETrue;
                    track('x');
                }
                break;
            case I2C_STATE_DATA:
                track('D');
				status2 = p_regs->ICSR2.BYTE;
                // Trying to send data, did it go through?
                if ((aInterrupt == I2C_INTERRUPT_ICTXI)
                        && (/*p_regs->ICSR2.BIT.TDRE*/status2 & BIT_TDRE)) {
                    // Finished sending data and got ack
                    // Now send the next byte of the transfer (if any)
                    p->iState = I2C_STATE_DATA;
                    if (p->iIndex < p->iDataLen) {
                        // Got data to send, send the next byte
                        // and a new interrupt will occur
                        p_regs->ICDRT = p->iData[p->iIndex++];
                        track('d');
                    } else {
                        // We're done with the write.  Let's wait for the final
                        // ending
                        p->iState = I2C_STATE_END;
                        track('e');
                    }
                } else if (status2 & (BIT_NACKF|BIT_AL)) {
                    // NAK or some type of error (NAK noted below)
                    p->iRequest->iStatus = I2C_ERROR;
                    doStop = ETrue;
                } else {
					// do nothing, extra interrupt
					// This is a weird problem.  When we read the status
					// (and status2) variable up above, the value typically is
					// 0x00, yet if a breakpoint is set here, the ICSR2 register
					// has already updated (usually to 0xC0 for TEND and TDRE bits).
					// To avoid a while loop, we'll just ignore it and let
					// the interrupt NOT get cleared and cause the interrupt
					// to occur again.  Apparently this happens only once, but the
					// next time the interrupt comes through, status & status2
					// properly read the TDRE/TEND bits.  What it appears to be is
					// the processor is firing off the interrupt BEFORE it updates
					// the ICSR2 register, so there is a race condition.
					// -- lshields 10/2/2012
					doStop = EFalse;
				}
                break;
            case I2C_STATE_END:
                track('E');
                if ((aInterrupt == I2C_INTERRUPT_ICTEI)
                        && (p_regs->ICSR2.BIT.TEND)) {
                    p->iRequest->iStatus = I2C_OK;
                    doStop = ETrue;
                    track('.');
                } else {
                    p->iRequest->iStatus = I2C_ERROR;
                    doStop = ETrue;
                    track('e');
                }
                break;
            case I2C_STATE_STOP:
                track('P');
                p->iState = I2C_STATE_IDLE;
                // End the stop
                p_regs->ICCR2.BIT.ST = 0;
                p_regs->ICSR2.BIT.STOP = 0;
                doEnd = ETrue;
                break;
        }
    }
    if (doStop) {
        track('T');
        // If we ended with a NAK, mark it as such (otherwise it is an I2C_ERROR)
        if (status & BIT_NACKF)
            p->iRequest->iStatus = I2C_NAK;

