FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_I2C.c
        // Done, now send a stop bit (for one more interrupt)
        p_regs->ICSR2.BIT.STOP = 0;
        p_regs->ICCR2.BIT.SP = 1;
        // Clear the receive register
        dummy = p_regs->ICDRR;
        p->iState = I2C_STATE_STOP;
        //doEnd = ETrue;
    }
    if (doEnd) {
        track('!');
        // Done, Clear NACK and STOP flags
        p_regs->ICSR2.BIT.NACKF = 0;
        p_regs->ICSR2.BIT.STOP = 0;

        // We are now done, call the callback routine to report
        // completion.  The callback knows this is inside an ISR
        p->iState = I2C_STATE_IDLE;
        p->iDoneFlag = ETrue;
        p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);
        track(';');
        // Stop receiving all interrupts
        p_regs->ICIER.BYTE = 0x00;
    }
}

T_uezError IRX63N_I2C_IsHung(void *aWorkspace, TBool *aBool)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;
    TBool sda, scl;

    sda = UEZGPIORead(p->iSDAPin);
    scl = UEZGPIORead(p->iSCLPin);

    *aBool = (!scl || !sda) ? ETrue : EFalse;

    return error;
}

T_uezError IRX63N_I2C_ResetBus(void *aWorkspace)
{
    T_uezError error = UEZ_ERROR_NONE;
    //T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;
    //TODO: implement reset functionality.

    return error;
}

static void IRX63N_ProcessStateRead(
        T_RX63N_I2C_Workspace *p,
        T_i2cInterrupt aInterrupt)
{
    T_RX63N_i2cRegs *p_regs = p->iRegs;
    TBool doEnd = EFalse;
    TBool doStop = EFalse;
    TBool doState = ETrue;
    TUInt8 dummy;
    TUInt8 status = p_regs->ICSR2.BYTE;

    track(' ');
    track('0' + aInterrupt);
    track_hex(status);
    track_hex(p->iState);
    if (status & BIT_TMOF) {
        track('/');
        track('T');
        p_regs->ICCR2.BIT.ST = 0;
        p_regs->ICCR2.BIT.RS = 0;
        p_regs->ICCR2.BIT.SP = 0;
        p_regs->ICSR2.BIT.TMOF = 0;
        p->iRequest->iStatus = I2C_ERROR;
        doState = EFalse;
        doEnd = ETrue;
    }
    if (status & BIT_AL) {
        track('/');
        track('L');
        p_regs->ICCR2.BIT.ST = 0;
        p_regs->ICCR2.BIT.RS = 0;
        p_regs->ICCR2.BIT.SP = 0;
        p_regs->ICSR2.BIT.TMOF = 0;
        p->iRequest->iStatus = I2C_ERROR;
        doState = EFalse;
        doEnd = ETrue;
    }
    if (doState) {
        switch (p->iState) {
            case I2C_STATE_START:
                //track_start();
                track('S');
                if (status & BIT_STOP) {
                    // We got a stop just as we are starting!
                    // Don't try to continue, but try to abort
                    doStop = ETrue;
                    track('?');
                } else if (status & BIT_TDRE) { // (aInterrupt == I2C_INTERRUPT_ICTXI) {
                    // We just sent the start bit, now send the address
                    p->iState = I2C_STATE_ADDR;
                    p_regs->ICDRT = p->iAddress;
                } else {
                    track('e');
                    // Got some type of error
                    p->iRequest->iStatus = I2C_ERROR;
                    doStop = ETrue;
                }
                if (status & BIT_START)
                    p_regs->ICSR2.BIT.START = 0;
                break;
            case I2C_STATE_ADDR:
                track('A');
                if (status & BIT_NACKF) {
                    track('e');
                    // NAK or some type of error
                    p->iRequest->iStatus = I2C_ERROR;
                    doStop = ETrue;
                } else if (status & BIT_RDRF) {
                    track('t');
                    // Finished sending slave address for read, and got ack (read style)
                    // Now send the first byte of the transfer (if any data, else abort)
                    p->iState = I2C_STATE_DATA;
                    if (p->iDataLen) {
                        track('d');
                        // Request the first byte and the rest the next interrupt
                        // will produce it
                        p->iIndex = 0;
                        p->iState = I2C_STATE_DATA;
                        dummy = p_regs->ICDRR;
                    } else {
                        track('.');
                        // No data payload, just stop here
                        p->iRequest->iStatus = I2C_OK;
                        doStop = ETrue;
                    }
                } else {
                    // Ignore this interrupt
                }
                break;
            case I2C_STATE_DATA:
                track('D');
                // Trying to send data, did it go through?
                if ((aInterrupt == I2C_INTERRUPT_ICRXI) && (status & BIT_RDRF)) {
                    track('r');
                    // Finished receiving data and got ack
                    // Do we have more than 2 bytes to go?
                    if ((p->iDataLen - p->iIndex) > 2) {
                        track('d');
                        // Still more than 2 bytes to go
                        // Store this byte and trigger the next interrupt
                        track('0' + p->iIndex);
                        dummy = p_regs->ICDRR;
                        track_hex(dummy);
                        p->iData[p->iIndex++] = dummy;
                    } else {
                        track('l');
                        // We've got one more byte to go, go ahead and put into
                        // ending mode
                        p->iState = I2C_STATE_END;
                        // Store this byte and trigger the next one but put in wait
                        // mode and put out an ack to the slave.
                        //p_regs->ICMR3.BIT.WAIT = 1;
                        // Ack that this is the last byte
                        p_regs->ICMR3.BIT.ACKBT = 1;
                        // Store this byte
                        track('0' + p->iIndex);
                        dummy = p_regs->ICDRR;
                        track_hex(dummy);
                        p->iData[p->iIndex++] = dummy;
                    }
                } else /* if (aInterrupt == I2C_INTERRUPT_ICEEI) */{
                    track('e');
                    // NAK or some type of error (NAK noted below)
                    p->iRequest->iStatus = I2C_ERROR;
                    doStop = ETrue;
                }
                break;
            case I2C_STATE_END:
                track('E');
                // Get the last byte in
                if (/*(aInterrupt == I2C_INTERRUPT_ICRXI) && */(status
                        & BIT_RDRF)) {
                    track('r');
                    // Got the last byte and ack
                    // Output a stop bit
                    p_regs->ICSR2.BIT.STOP = 0;
                    p_regs->ICCR2.BIT.SP = 1;

                    // read last received byte
                    track('0' + p->iIndex);
                    track_hex(dummy);
                    dummy = p_regs->ICDRR;
                    p->iData[p->iIndex++] = dummy;

                    // Turn off the wait mode
                    p_regs->ICMR3.BIT.WAIT = 0;
                    // Everything is good
                    p->iRequest->iStatus = I2C_OK;
                    p->iState = I2C_STATE_STOP;
                    //doEnd = ETrue;
                } else /* if (aInterrupt == I2C_INTERRUPT_ICEEI) */{
                    track('e');
                    // NAK or some type of error (NAK noted below)
                    p->iRequest->iStatus = I2C_ERROR;
                    doStop = ETrue;
                }
                break;
            case I2C_STATE_STOP:
                track('P');
                p->iState = I2C_STATE_IDLE;
                // End the stop
                p_regs->ICCR2.BIT.ST = 0;
                p_regs->ICSR2.BIT.STOP = 0;
                doEnd = ETrue;
                break;
            case I2C_STATE_IDLE:
                if (status & BIT_STOP) {
                    // Clear any spurious stops
                    p_regs->ICCR2.BIT.SP = 0;
                    p_regs->ICSR2.BIT.STOP = 0;
                }
                break;
        }
    }
    if (doStop) {
        track('T');
        // If we ended with a NAK, mark it as such (otherwise it is an I2C_ERROR)
        if (status & BIT_NACKF)
            p->iRequest->iStatus = I2C_NAK;

