FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_I2C.c
        // Done, now send a stop bit (for one more interrupt)
        p_regs->ICSR2.BIT.STOP = 0;
        p_regs->ICCR2.BIT.SP = 1;
        // Clear the receive register
        dummy = p_regs->ICDRR;
        p->iState = I2C_STATE_STOP;
        //doEnd = ETrue;
    }
    if (doEnd) {
        track('!');
        // Wait for stop bit to en quickly
        //        while (!p_regs->ICSR2.BIT.STOP)
        //            {}
        // Done, Clear NACK and STOP flags
        p_regs->ICSR2.BIT.NACKF = 0;
        p_regs->ICSR2.BIT.STOP = 0;

        // We are now done, call the callback routine to report
        // completion.  The callback knows this is inside an ISR
        p->iState = I2C_STATE_IDLE;
        p->iDoneFlag = ETrue;
        p->iCompleteFunc(p->iCompleteWorkspace, p->iRequest);

        // Stop receiving all interrupts
        p_regs->ICIER.BYTE = 0x00;
    }
}

static void IRX63N_ProcessState(
        T_RX63N_I2C_Workspace *p,
        T_i2cInterrupt aInterrupt)
{
    if (p->iAddress & 1)
        IRX63N_ProcessStateRead(p, aInterrupt);
    else
        IRX63N_ProcessStateWrite(p, aInterrupt);
}

IRQ_ROUTINE(IRX63N_I2C0InterruptHandler_ICEEI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c0Workspace, I2C_INTERRUPT_ICEEI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C0InterruptHandler_ICRXI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c0Workspace, I2C_INTERRUPT_ICRXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C0InterruptHandler_ICTXI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c0Workspace, I2C_INTERRUPT_ICTXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C0InterruptHandler_ICTEI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c0Workspace, I2C_INTERRUPT_ICTEI);
    IRQ_END();
}

IRQ_ROUTINE(IRX63N_I2C1InterruptHandler_ICEEI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c1Workspace, I2C_INTERRUPT_ICEEI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C1InterruptHandler_ICRXI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c1Workspace, I2C_INTERRUPT_ICRXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C1InterruptHandler_ICTXI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c1Workspace, I2C_INTERRUPT_ICTXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C1InterruptHandler_ICTEI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c1Workspace, I2C_INTERRUPT_ICTEI);
    IRQ_END();
}


IRQ_ROUTINE(IRX63N_I2C2InterruptHandler_ICEEI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c2Workspace, I2C_INTERRUPT_ICEEI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C2InterruptHandler_ICRXI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c2Workspace, I2C_INTERRUPT_ICRXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C2InterruptHandler_ICTXI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c2Workspace, I2C_INTERRUPT_ICTXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C2InterruptHandler_ICTEI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c2Workspace, I2C_INTERRUPT_ICTEI);
    IRQ_END();
}

IRQ_ROUTINE(IRX63N_I2C3InterruptHandler_ICEEI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c3Workspace, I2C_INTERRUPT_ICEEI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C3InterruptHandler_ICRXI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c3Workspace, I2C_INTERRUPT_ICRXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C3InterruptHandler_ICTXI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c3Workspace, I2C_INTERRUPT_ICTXI);
    IRQ_END();
}
IRQ_ROUTINE(IRX63N_I2C3InterruptHandler_ICTEI)
{
    IRQ_START();
    IRX63N_ProcessState(G_RX63N_i2c3Workspace, I2C_INTERRUPT_ICTEI);
    IRQ_END();
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_I2C0_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N I2C Bus0 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_I2C0_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;

    p->iRegs = (T_RX63N_i2cRegs *)&RIIC0;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    p->iMSTPBBit = 21;
    p->iFirstInit = EFalse;
    p->iState = I2C_STATE_IDLE;

    G_RX63N_i2c0Workspace = p;

    // Setup interrupt vectors
    InterruptRegister(VECT_RIIC0_EEI0, IRX63N_I2C0InterruptHandler_ICEEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C0:EEI");
    InterruptEnable(VECT_RIIC0_EEI0);

    InterruptRegister(VECT_RIIC0_RXI0, IRX63N_I2C0InterruptHandler_ICRXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C0:RXI");
    InterruptEnable(VECT_RIIC0_RXI0);

    InterruptRegister(VECT_RIIC0_TXI0, IRX63N_I2C0InterruptHandler_ICTXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C0:TXI");
    InterruptEnable(VECT_RIIC0_TXI0);

    InterruptRegister(VECT_RIIC0_TEI0, IRX63N_I2C0InterruptHandler_ICTEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C0:TEI");
    InterruptEnable(VECT_RIIC0_TEI0);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_I2C1_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N I2C Bus1 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_I2C1_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;

    p->iRegs = (T_RX63N_i2cRegs *)&RIIC1;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    p->iMSTPBBit = 20;
    p->iFirstInit = EFalse;
    p->iState = I2C_STATE_IDLE;

    G_RX63N_i2c1Workspace = p;

    // Setup interrupt vectors
    InterruptRegister(VECT_RIIC1_EEI1, IRX63N_I2C1InterruptHandler_ICEEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C1:EEI");
    InterruptEnable(VECT_RIIC1_EEI1);

    InterruptRegister(VECT_RIIC1_RXI1, IRX63N_I2C1InterruptHandler_ICRXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C1:RXI");
    InterruptEnable(VECT_RIIC1_RXI1);

    InterruptRegister(VECT_RIIC1_TXI1, IRX63N_I2C1InterruptHandler_ICTXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C1:TXI");
    InterruptEnable(VECT_RIIC1_TXI1);

    InterruptRegister(VECT_RIIC1_TEI1, IRX63N_I2C1InterruptHandler_ICTEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C1:TEI");
    InterruptEnable(VECT_RIIC1_TEI1);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_I2C2_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N I2C Bus0 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_I2C2_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;

    p->iRegs = (T_RX63N_i2cRegs *)&RIIC2;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    p->iMSTPBBit = 21;
    p->iFirstInit = EFalse;
    p->iState = I2C_STATE_IDLE;

    G_RX63N_i2c2Workspace = p;

    // Setup interrupt vectors
    InterruptRegister(VECT_RIIC2_EEI2, IRX63N_I2C1InterruptHandler_ICEEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C2:EEI");
    InterruptEnable(VECT_RIIC2_EEI2);

    InterruptRegister(VECT_RIIC2_RXI2, IRX63N_I2C1InterruptHandler_ICRXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C2:RXI");
    InterruptEnable(VECT_RIIC2_RXI2);

    InterruptRegister(VECT_RIIC2_TXI2, IRX63N_I2C1InterruptHandler_ICTXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C2:TXI");
    InterruptEnable(VECT_RIIC2_TXI2);

