FutureDesigns/uEZ/uEZ/Source/Processor/Renesas/RX63N/RX63N_I2C.c
    InterruptRegister(VECT_RIIC2_TEI2, IRX63N_I2C1InterruptHandler_ICTEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C2:TEI");
    InterruptEnable(VECT_RIIC2_TEI2);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * Routine:  RX63N_I2C3_InitializeWorkspace
 *---------------------------------------------------------------------------*
 * Description:
 *      Setup the RX63N I2C Bus1 workspace.
 * Inputs:
 *      void *aW                    -- Particular I2C workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
T_uezError RX63N_I2C3_InitializeWorkspace(void *aWorkspace)
{
    T_RX63N_I2C_Workspace *p = (T_RX63N_I2C_Workspace *)aWorkspace;

    p->iRegs = (T_RX63N_i2cRegs *)&RIIC3;
    p->iDoneFlag = ETrue;
    p->iCompleteFunc = 0;
    p->iMSTPBBit = 20;
    p->iFirstInit = EFalse;
    p->iState = I2C_STATE_IDLE;

    G_RX63N_i2c3Workspace = p;

    // Setup interrupt vectors
    InterruptRegister(VECT_RIIC3_EEI3, IRX63N_I2C1InterruptHandler_ICEEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C3:EEI");
    InterruptEnable(VECT_RIIC3_EEI3);

    InterruptRegister(VECT_RIIC3_RXI3, IRX63N_I2C1InterruptHandler_ICRXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C3:RXI");
    InterruptEnable(VECT_RIIC3_RXI3);

    InterruptRegister(VECT_RIIC3_TXI3, IRX63N_I2C1InterruptHandler_ICTXI,
            INTERRUPT_PRIORITY_NORMAL, "I2C3:TXI");
    InterruptEnable(VECT_RIIC3_TXI3);

    InterruptRegister(VECT_RIIC3_TEI3, IRX63N_I2C1InterruptHandler_ICTEI,
            INTERRUPT_PRIORITY_NORMAL, "I2C3:TEI");
    InterruptEnable(VECT_RIIC3_TEI3);

    return UEZ_ERROR_NONE;
}

/*---------------------------------------------------------------------------*
 * HAL Interface tables:
 *---------------------------------------------------------------------------*/
const HAL_I2CBus I2C_RX63N_RIIC0_Interface = {
        "RX63N:I2C0",
        0x0100,
        RX63N_I2C0_InitializeWorkspace,
        sizeof(T_RX63N_I2C_Workspace),

        IRX63N_I2C_StartReadInterrupts,
        IRX63N_I2C_StartWriteInterrupts,
        0,0,0,
        IRX63N_I2C_IsHung, IRX63N_I2C_ResetBus
};

const HAL_I2CBus I2C_RX63N_RIIC1_Interface = {
        "RX63N:I2C1",
        0x0100,
        RX63N_I2C1_InitializeWorkspace,
        sizeof(T_RX63N_I2C_Workspace),

        IRX63N_I2C_StartReadInterrupts,
        IRX63N_I2C_StartWriteInterrupts,
        0,0,0,
        IRX63N_I2C_IsHung, IRX63N_I2C_ResetBus
};
		
const HAL_I2CBus I2C_RX63N_RIIC2_Interface = {
        "RX63N:I2C2",
        0x0100,
        RX63N_I2C2_InitializeWorkspace,
        sizeof(T_RX63N_I2C_Workspace),

        IRX63N_I2C_StartReadInterrupts,
        IRX63N_I2C_StartWriteInterrupts,
        0,0,0,
        IRX63N_I2C_IsHung, IRX63N_I2C_ResetBus
};
		
const HAL_I2CBus I2C_RX63N_RIIC3_Interface = {
        "RX63N:I2C3",
        0x0100,
        RX63N_I2C3_InitializeWorkspace,
        sizeof(T_RX63N_I2C_Workspace),

        IRX63N_I2C_StartReadInterrupts,
        IRX63N_I2C_StartWriteInterrupts,
        0,0,0,
        IRX63N_I2C_IsHung, IRX63N_I2C_ResetBus
};
		
void RX63N_RIIC0_Require(void)
{
	T_RX63N_I2C_Workspace *p;
	static const T_RX63N_MPC_ConfigList pins[] = {
		{GPIO_P12, 0x0F},	// SCL0
		{GPIO_P13, 0x0F},	// SDA0
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RIIC0", (T_halInterface *)&I2C_RX63N_RIIC0_Interface, 0, (T_halWorkspace **)&p);
	
	RX63N_MPC_ConfigAllPins(pins, ARRAY_COUNT(pins));     

    p->iSCLPin = GPIO_P12;
    p->iSDAPin = GPIO_P13;
}

void RX63N_RIIC1_Require(void)
{
	T_RX63N_I2C_Workspace *p;
	static const T_RX63N_MPC_ConfigList pins[] = {
		{GPIO_P21, 0x0F},	// SCL1
		{GPIO_P20, 0x0F},	// SDA1
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RIIC1", (T_halInterface *)&I2C_RX63N_RIIC1_Interface, 0, (T_halWorkspace **)&p);
	
	RX63N_MPC_ConfigAllPins(pins, ARRAY_COUNT(pins));

    p->iSCLPin = GPIO_P21;
    p->iSDAPin = GPIO_P20;
}

void RX63N_RIIC2_Require(void)
{
	T_RX63N_I2C_Workspace *p;
	static const T_RX63N_MPC_ConfigList pins[] = {
		{GPIO_P16, 0x0F},	// SCL2
		{GPIO_P17, 0x0F},	// SDA2
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RIIC2", (T_halInterface *)&I2C_RX63N_RIIC2_Interface, 0, (T_halWorkspace **)&p);
	
	RX63N_MPC_ConfigAllPins(pins, ARRAY_COUNT(pins));

    p->iSCLPin = GPIO_P16;
    p->iSDAPin = GPIO_P17;
}

void RX63N_RIIC3_Require(void)
{
	T_RX63N_I2C_Workspace *p;
	static const T_RX63N_MPC_ConfigList pins[] = {
		{GPIO_PC0, 0x0F},	// SCL3
		{GPIO_PC1, 0x0F},	// SDA3
    };

    HAL_DEVICE_REQUIRE_ONCE();
    HALInterfaceRegister("RIIC3", (T_halInterface *)&I2C_RX63N_RIIC3_Interface, 0, (T_halWorkspace **)&p);
	
	RX63N_MPC_ConfigAllPins(pins, ARRAY_COUNT(pins));

    p->iSCLPin = GPIO_PC0;
    p->iSDAPin = GPIO_PC1;
}

/*-------------------------------------------------------------------------*
 * End of File:  RX63N_I2C.c
 *-------------------------------------------------------------------------*/
